In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
table1=pd.read_excel("Test excel.xlsx",header=20,usecols=("A:E"),nrows=101)

In [3]:
table2=pd.read_excel("Test excel.xlsx",header=20,usecols=("G:K"))

In [4]:
table1.head()

           name   Status        Type Company Name     Amount
0  Asia&flash L  Success    Deposits           AD  155364.61
1  Asia&flash L  Success    Deposits           AF   11679.29
2  Asia&flash L     Fail    Deposits           AG   86071.89
3  Asia&flash L  Success    Deposits           AI     593.00
4  Asia&flash L  Success  Chargeback           AL      10.00

In [5]:
table2.head()

         name.1 Status.1    Type.1 Company Name.1    Amount.1
0  Asia&flash A  Success  Withdraw             ZW    34860.49
1  Asia&flash L  Success  Withdraw             ZW   128111.67
2  Asia&flash A  Success  Withdraw             ZW  4114926.00
3  Asia&flash L  Success  Withdraw             ZW    10964.42
4  Asia&flash L  Success  Withdraw             GF     3950.00

In [6]:
table2.columns=['name', 'Status', 'Type', 'Company Name', 'Amount']

<center><h1><b>Task_1 | First part</b></h1></center>

<b>1. Find discrepancy in two tables (Table 1 and Table 2) by amounts by types of transactions -If transaction was succeeded	
Deposits/widraw/refund/chargback</b>

In [7]:
table1.head()

           name   Status        Type Company Name     Amount
0  Asia&flash L  Success    Deposits           AD  155364.61
1  Asia&flash L  Success    Deposits           AF   11679.29
2  Asia&flash L     Fail    Deposits           AG   86071.89
3  Asia&flash L  Success    Deposits           AI     593.00
4  Asia&flash L  Success  Chargeback           AL      10.00

In [8]:
table1['Status'].unique()

array(['Success', 'Fail'], dtype=object)

In [9]:
table1_success=table1[table1['Status']=='Success']

In [10]:
table1_result=pd.DataFrame(table1_success.groupby(by="Type")["Amount"].sum())

In [11]:
table1_result

                 Amount
Type
Chargeback     12980.00
Deposits    69479740.54
Refund         51109.95
Withdraw    56343731.40

In [12]:
table2_success=table2[table2["Status"]=='Success']

In [13]:
table2_result=pd.DataFrame(table2_success.groupby('Type')["Amount"].sum())

In [14]:
table2_result

                 Amount
Type
Chargeback   4156527.74
Deposits    58480880.41
Refund         50909.95
Withdraw    79602779.15

In [15]:
final_result=pd.merge(table1_result,table2_result,how="left",left_index=True,right_index=True,suffixes=('_table1_succe_trans_amount','_table2_succes_trans_amount'))

In [16]:
final_result

,Amount_table1_succe_trans_amount,Amount_table2_succes_trans_amount
Type,,
Chargeback,12980.00,4156527.74
Deposits,69479740.54,58480880.41
Refund,51109.95,50909.95
Withdraw,56343731.40,79602779.15

In [17]:
final_result["diff"]=abs(final_result["Amount_table1_succe_trans_amount"]-final_result["Amount_table2_succes_trans_amount"])

In [18]:
final_result

,Amount_table1_succe_trans_amount,Amount_table2_succes_trans_amount,diff
Type,,,
Chargeback,12980.00,4156527.74,4143547.74
Deposits,69479740.54,58480880.41,10998860.13
Refund,51109.95,50909.95,200.00
Withdraw,56343731.40,79602779.15,23259047.75

<center><h1><b>Task_1 |  Second part</b></h1></center>

<b>Count of Failed Deposits /Average deposits/Max Withdraw/Min Chargeback</b>

In [19]:
table1.head()

           name   Status        Type Company Name     Amount
0  Asia&flash L  Success    Deposits           AD  155364.61
1  Asia&flash L  Success    Deposits           AF   11679.29
2  Asia&flash L     Fail    Deposits           AG   86071.89
3  Asia&flash L  Success    Deposits           AI     593.00
4  Asia&flash L  Success  Chargeback           AL      10.00

In [20]:
mask1_table1=table1['Type']=='Deposits'

In [21]:
mask2_table1=table1['Status']=="Fail"

In [22]:
table1[mask1_table1 & mask2_table1]

            name Status      Type Company Name      Amount
2   Asia&flash L   Fail  Deposits           AG    86071.89
47  Asia&flash L   Fail  Deposits           GA  4564523.00
55  Asia&flash L   Fail  Deposits           GM  2455732.00

In [23]:
Count_of_Failed_Deposits_table1=len(table1[mask1_table1 & mask2_table1])
Count_of_Failed_Deposits_table1

3

In [24]:
Average_deposits_table1=table1.groupby("Type")['Amount'].mean().loc['Deposits' ]
Average_deposits_table1# Average deposit (including both successful and failed transactions)

1143075.6332835823

In [25]:
Average_deposits_table1_for_successful_transaction=table1[table1['Status']=="Success"].groupby("Type")["Amount"].mean().loc["Deposits"]
Average_deposits_table1_for_successful_transaction

1085620.9459375

In [26]:
Max_Withdraw_table1=table1.groupby("Type")["Amount"].max().loc["Withdraw"]
Max_Withdraw_table1# I verified whether this maximum withdrawal was successful,yes it was.

19623485.77

In [27]:
min_Chargeback_table1=table1.groupby("Type")["Amount"].min().loc["Chargeback"]
min_Chargeback_table1#I verified the outcome of the minimum chargeback to determine its success.it was successful.

10.0

In [28]:
table2.head()

           name   Status      Type Company Name      Amount
0  Asia&flash A  Success  Withdraw           ZW    34860.49
1  Asia&flash L  Success  Withdraw           ZW   128111.67
2  Asia&flash A  Success  Withdraw           ZW  4114926.00
3  Asia&flash L  Success  Withdraw           ZW    10964.42
4  Asia&flash L  Success  Withdraw           GF     3950.00

In [29]:
mask1_table2=table2['Type']=='Deposits'

In [30]:
mask2_table2=table2['Status']=="Fail"

In [31]:
table2[mask1_table2 & mask2_table2]

             name Status      Type Company Name       Amount
26   Asia&flash L   Fail  Deposits           GF     53000.00
27   Asia&flash L   Fail  Deposits           FD  12574345.36
97   Asia&flash A   Fail  Deposits           OK    176250.00
109  Asia&flash L   Fail  Deposits           OK     18049.60
110  Asia&flash S   Fail  Deposits           FD      4381.28
111  Asia&flash L   Fail  Deposits           FD    181467.00
112  Asia&flash L   Fail  Deposits           FD      3841.20
113  Asia&flash L   Fail  Deposits           FD       200.00
114  Asia&flash L   Fail  Deposits           FD  19623485.76

In [32]:
Count_of_Failed_Deposits_table2=len(table2[mask1_table2 & mask2_table2])
Count_of_Failed_Deposits_table2

9

In [33]:
Average_deposits_table2=table2.groupby("Type")['Amount'].mean().loc['Deposits' ]
Average_deposits_table2#this average deposite includes failed and successful transactions

1248163.0220547945

In [34]:
Average_deposits_table2_for_successful_transaction=table2[table2['Status']=="Success"].groupby("Type")["Amount"].mean().loc["Deposits"]
Average_deposits_table2_for_successful_transaction#this average deposite is only for successful transactions

913763.75640625

In [35]:
Max_Withdraw_table2=table2.groupby("Type")["Amount"].max().loc["Withdraw"]
Max_Withdraw_table2#I checked if this transaction was successful. Yes, it was.

19623485.76

In [36]:
min_Chargeback_table2=table2.groupby("Type")["Amount"].min().loc["Chargeback"]
min_Chargeback_table2#I verified the outcome of the minimum chargeback to determine whether it was successful. It was.

10.0

In [37]:
pd.DataFrame({'Count_of_Failed_Deposits':[3,9],'Average_deposits':[1143075.6332835823,1248163.0220547945],"Average_deposits_succful_trans":[1085620.9459375,913763.75640625],
              'Max_Withdraw_table1':[19623485.77,19623485.76],
 'min_Chargeback':[10,10]},index=['table1','table2'])

,Count_of_Failed_Deposits,Average_deposits,Average_deposits_succful_trans,Max_Withdraw_table1,min_Chargeback
table1,3,1.143076e+06,1.085621e+06,19623485.77,10
table2,9,1.248163e+06,9.137638e+05,19623485.76,10

<center><h1><b>Task_2</b></h1></center>

In [38]:
table1.head()

           name   Status        Type Company Name     Amount
0  Asia&flash L  Success    Deposits           AD  155364.61
1  Asia&flash L  Success    Deposits           AF   11679.29
2  Asia&flash L     Fail    Deposits           AG   86071.89
3  Asia&flash L  Success    Deposits           AI     593.00
4  Asia&flash L  Success  Chargeback           AL      10.00

In [39]:
success=table1[table1['Status']=='Success']

In [40]:
company_pivotal=pd.DataFrame(success.groupby(["Company Name",'Type'])["Amount"].sum()).unstack()

In [41]:
company_pivotal.reset_index()

     Company Name     Amount
Type              Chargeback   Deposits Refund    Withdraw
0              AD        NaN  155364.61    NaN         NaN
1              AF        NaN   11679.29    NaN         NaN
2              AI        NaN     593.00    NaN         NaN
3              AL       10.0        NaN    NaN         NaN
4              AM        NaN   16465.00    NaN         NaN
..            ...        ...        ...    ...         ...
79             WS        NaN        NaN    NaN     3950.00
80             YE        NaN        NaN    NaN    10964.42
81             ZM        NaN        NaN    NaN  4114926.00
82             ZR        NaN        NaN    NaN   128111.67
83             ZW        NaN        NaN    NaN    34860.49

[84 rows x 5 columns]

In [42]:
company_pivotal.columns=['Chargeback','Deposits','Refund','Withdraw']

In [43]:
company_pivotal.fillna(0,inplace=True)

In [44]:
company_pivotal

              Chargeback   Deposits  Refund    Withdraw
Company Name
AD                   0.0  155364.61     0.0        0.00
AF                   0.0   11679.29     0.0        0.00
AI                   0.0     593.00     0.0        0.00
AL                  10.0       0.00     0.0        0.00
AM                   0.0   16465.00     0.0        0.00
...                  ...        ...     ...         ...
WS                   0.0       0.00     0.0     3950.00
YE                   0.0       0.00     0.0    10964.42
ZM                   0.0       0.00     0.0  4114926.00
ZR                   0.0       0.00     0.0   128111.67
ZW                   0.0       0.00     0.0    34860.49

[84 rows x 4 columns]

In [45]:
company_pivotal['expenses']=company_pivotal.iloc[:,[0,2,3]].sum(axis=1)

In [46]:
company_pivotal.reset_index(inplace=True)

In [47]:
company_pivotal.head()

  Company Name  Chargeback   Deposits  Refund  Withdraw  expenses
0           AD         0.0  155364.61     0.0       0.0       0.0
1           AF         0.0   11679.29     0.0       0.0       0.0
2           AI         0.0     593.00     0.0       0.0       0.0
3           AL        10.0       0.00     0.0       0.0      10.0
4           AM         0.0   16465.00     0.0       0.0       0.0

In [48]:
company_pivotal['net_income']=company_pivotal['Deposits']-company_pivotal['expenses']

In [49]:
company_pivotal.sort_values('net_income',ascending=False).iloc[0:5]

,Company Name,Chargeback,Deposits,Refund,Withdraw,expenses,net_income
44,GE,0.0,13062777.64,0.0,0.0,0.0,13062777.64
47,GI,0.0,6073521.49,0.0,0.0,0.0,6073521.49
31,BZ,0.0,5290075.57,0.0,0.0,0.0,5290075.57
74,VE,0.0,1818519.41,0.0,0.0,0.0,1818519.41
78,VU,0.0,1755549.35,0.0,0.0,0.0,1755549.35

<center><h1><b>Task_3</h1></b></center>

In [50]:
##according to data from task1-table2

In [51]:
table2.head()

           name   Status      Type Company Name      Amount
0  Asia&flash A  Success  Withdraw           ZW    34860.49
1  Asia&flash L  Success  Withdraw           ZW   128111.67
2  Asia&flash A  Success  Withdraw           ZW  4114926.00
3  Asia&flash L  Success  Withdraw           ZW    10964.42
4  Asia&flash L  Success  Withdraw           GF     3950.00

In [52]:
success_table2=table2[table2['Status']=='Success']

In [53]:
company_pivotal_2=pd.DataFrame(success_table2.groupby(["Company Name",'Type'])["Amount"].sum()).unstack().fillna(0)

In [54]:
company_pivotal_2.head().reset_index()

     Company Name      Amount
Type               Chargeback     Deposits    Refund     Withdraw
0              AA      500.00   1473915.81      0.00         0.00
1              DJ        0.00         0.00  50899.95         0.00
2              FD        0.00  22810953.77      0.00  32206253.60
3              GF        0.00  21954337.58     10.00   3641588.81
4              OK  4121167.25  11692946.89      0.00   9707786.84

In [55]:
company_pivotal_2.columns=['Chargeback','Deposits','Refund','Withdraw']

In [56]:
company_pivotal_2['expenses']=company_pivotal_2.iloc[:,[0,2,3]].sum(axis=1)

In [57]:
company_pivotal_2.reset_index(inplace=True)

In [58]:
company_pivotal_2

  Company Name  Chargeback     Deposits    Refund     Withdraw     expenses
0           AA      500.00   1473915.81      0.00         0.00       500.00
1           DJ        0.00         0.00  50899.95         0.00     50899.95
2           FD        0.00  22810953.77      0.00  32206253.60  32206253.60
3           GF        0.00  21954337.58     10.00   3641588.81   3641598.81
4           OK  4121167.25  11692946.89      0.00   9707786.84  13828954.09
5           ZW    34860.49    548726.36      0.00  34047149.90  34082010.39

In [59]:
company_pivotal_2['net_income']=company_pivotal_2['Deposits']-company_pivotal_2['expenses']

In [60]:
company_pivotal_2

,Company Name,Chargeback,Deposits,Refund,Withdraw,expenses,net_income
0,AA,500.00,1473915.81,0.00,0.00,500.00,1473415.81
1,DJ,0.00,0.00,50899.95,0.00,50899.95,-50899.95
2,FD,0.00,22810953.77,0.00,32206253.60,32206253.60,-9395299.83
3,GF,0.00,21954337.58,10.00,3641588.81,3641598.81,18312738.77
4,OK,4121167.25,11692946.89,0.00,9707786.84,13828954.09,-2136007.20
5,ZW,34860.49,548726.36,0.00,34047149.90,34082010.39,-33533284.03